In [2]:
import pandas as pd

In [3]:
employees = pd.DataFrame({
    "EmpID": [1, 2, 3],
    "Name": ["Alice", "Bob", "Charlie"],
    "DeptID": [10, 20, 30]
})

In [4]:
departments = pd.DataFrame({
    "DeptID": [10, 20, 40],
    "DeptName": ["HR", "Engineering", "Marketing"]
})

In [5]:
employees

   EmpID     Name  DeptID
0      1    Alice      10
1      2      Bob      20
2      3  Charlie      30

In [6]:
departments

   DeptID     DeptName
0      10           HR
1      20  Engineering
2      40    Marketing

In [10]:
# Joining two data frame

# Common dept id from both the data frame

# By default how is inner join

pd.merge(employees,departments, on="DeptID")   # Inner Join

   EmpID   Name  DeptID     DeptName
0      1  Alice      10           HR
1      2    Bob      20  Engineering

In [11]:
pd.merge(employees,departments, on="DeptID",how="left")   # Left Join

   EmpID     Name  DeptID     DeptName
0      1    Alice      10           HR
1      2      Bob      20  Engineering
2      3  Charlie      30          NaN

In [13]:
pd.merge(employees,departments, on="DeptID",how="right")   # Right Join

   EmpID   Name  DeptID     DeptName
0    1.0  Alice      10           HR
1    2.0    Bob      20  Engineering
2    NaN    NaN      40    Marketing

In [16]:
pd.merge(employees,departments, on="DeptID", how="outer")   # Outer Join

# All the data from both the data frame

   EmpID     Name  DeptID     DeptName
0    1.0    Alice      10           HR
1    2.0      Bob      20  Engineering
2    3.0  Charlie      30          NaN
3    NaN      NaN      40    Marketing

In [19]:
# Merging two data frame

df1 = pd.DataFrame({"Name": ["Alice","Bob"]})
df2 = pd.DataFrame({"Name": ["Charlie","David"]})

In [20]:
df1

    Name
0  Alice
1    Bob

In [21]:
df2

      Name
0  Charlie
1    David

In [23]:
# Vertical concat df1 and df2  (axis=0)

pd.concat([df1,df2])

      Name
0    Alice
1      Bob
0  Charlie
1    David

In [28]:
# Horizontal concat df1 and df2 (axis=1)

pd.concat([df1,df2],axis=1)

    Name     Name
0  Alice  Charlie
1    Bob    David

In [27]:
pd.merge(df1,df2, on="Name", how="outer")

      Name
0    Alice
1      Bob
2  Charlie
3    David

In [29]:
df3 = pd.DataFrame({"Name": ["Alice","Bob"], "score": [100,200]})
df4 = pd.DataFrame({"Name": ["Charlie","David"], "age": [20,21]})

In [30]:
df3

    Name  score
0  Alice    100
1    Bob    200

In [31]:
df4

      Name  age
0  Charlie   20
1    David   21

In [33]:
pd.concat([df3,df4])

      Name  score   age
0    Alice  100.0   NaN
1      Bob  200.0   NaN
0  Charlie    NaN  20.0
1    David    NaN  21.0

In [34]:
pd.concat([df3,df4], axis=1)

    Name  score     Name  age
0  Alice    100  Charlie   20
1    Bob    200    David   21